Repository: NoopikxD/PromtTest
Catalog: CorpusSearch/CorpusSearch/en-ru.tmx
Source language: en
Languages: ru

source: That' s nice.
ru: Каждый раз, заходя сюда, мне придётся сыпать за собой крошки.

source: This is the kitchen, huh?
ru: Не стоит вам падать духом.

source: ls it big enough for you?
ru: Она большая, но, всё равно, это всего лишь кухня.

source: This whole place is such an enormous maze.
ru: К очень многому из этого вам даже не придётся прикасаться.

source: I' il have to leave a trail of breadcrumbs every time I come in.
ru: Я бы не знала, что с этим делать.

source: A lot of this stuff you' il never have to touch.
ru: Но будьте уверены, вы можете не беспокоиться насчёт пищи.

source: One thing for sure, you don' t have to worry about food.
ru: Здесь можно кушать целый год и ни разу не повторить меню.

source: Right here is our walk- in freezer.
ru: Здесь находится наш камерный холодильник.

source: This is where we keep all of our meat.
ru: Тут мы храним всё наше мясо.

source: You got 1 5 rib roasts...... 30 ten- pound bags of hamburger.
ru: 15 кусков мяса на рёбрах...... 30 упаковок гамбургеров.

source: We got 1 2 turkeys, about 40 chickens...... 50 sirloin steaks, two dozen of pork roast...... and 20 legs of lamb.
ru: У нас тут 12 индеек, примерно 40 куриц...... 50 филейных стейков, 2 дюжины кусков свинины для жарки...... и 20 бараньих ножек.

source: Do you like lamb, Doc?
ru: Ты любишь баранину, Док?

source: You don' t?
ru: Не любишь?

source: What' s your favorite food, then?
ru: Какая же твоя любимая еда?

source: French fries and ketchup.
ru: Жареная картошка и кетчуп.

source: I think we can manage that too, Doc.
ru: Думаю, мы сможем приготовить и это, Док.

source: Come along, now.
ru: Пошли дальше.

source: Watch your step.
ru: Не споткнитесь.

source: How' d you know we call him Doc?
ru: Вы знаете, что мы зовём его Док?

source: You called Danny "Doc" twice.
ru: - Вы дважды назвали Дэнни "Доком".

source: I did?
ru: Я назвал?

source: We call him Doc sometimes, like in the Bugs Bunny cartoons.
ru: Иногда мы называем его "Док", как в мультиках про Багза Банни.

source: But how did you know?
ru: Но как вы узнали об этом?

source: I guess I probably heard you call him that.
ru: Наверно, я слышал, что вы называли его так.

source: But I honestly don' t remember...... calling him that since we' ve been with you.
ru: Но я не помню, чтобы я...... называла его так за то время, что мы были с вами.

source: What' s up, Doc?
ru: Во всяком случае, выглядит он, как Док, верно ведь?

source: Now, this is the storeroom.
ru: Как дела, Док?

source: In here is where we keep...... all the dried goods and the canned goods.
ru: Здесь мы храним все наши сухие продукты и консервы.

source: We got canned fruits and vegetables...... canned fish and meats, hot and cold cereals.
ru: У нас есть консервированные фрукты и овощи...... консервированная...... рыба и мясо, изделия из зерна для горячих и холодных блюд.

source: Post Toasties, Corn Flakes, Sugar Puffs...... Rice IKrispies, oatmeal, Wheatena and Cream of Wheat.
ru: Сухарики, кукурузные хлопья, сахарная пудра...... рисовое печенье, геркулес, пшеничный порошок и мука.

source: You got a dozen jugs of black molasses.
ru: Вам остаётся дюжина банок с чёрной патокой.

source: We got 60 boxes of dried milk...
ru: Есть 60 ящиков сухого молока...

source: How' d you like some ice cream, Doc?
ru: Хочешь мороженого, Док?

source: Sociables, finger rolls...... and 7 kinds of what have you.
ru: ... печенье, палочки с начинкой...... и по 7 сортов всего, что хотите.

source: Now, we' ve got dried peaches, dried apricots...... dried raisins and dried prunes.
ru: У нас есть сушёные персики, сушёные абрикосы...... изюм и чернослив.

source: You know, you got to keep regular if you want to be happy.
ru: Знаете, нужно регулярно питаться, если вы хотите жить счастливо.

source: - How' re you getting on?
ru: - Как идут дела?

source: - Fine.
ru: - Отлично.

source: Can we borrow Mrs. Torrance?
ru: У ступите нам миссис Торрэнс?

source: We' re on our way to the basement.
ru: Мы сейчас идём в подвал.

source: I promise we won' t keep her very long.
ru: Обещаю, мы не задержим её надолго.

source: No problem, Mr. Ullman.
ru: Ничего.

source: I was just getting to the ice cream.
ru: Любишь мороженое, Док?

source: You like ice cream, Doc?
ru: Я так и думал.

source: You folks mind if I give Danny some ice cream while we wait?
ru: Вы не против того, чтобы я угостил Дэнни мороженым?

source: - We don' t mind.
ru: - Мы не против.

source: - Sound good to you, Doc?
ru: - Ты доволен, Док?

source: Okay, you behave yourself.
ru: Ладно, веди себя хорошо.

source: What kind of ice cream do you like?
ru: Какое именно мороженое ты любишь?

source: Chocolate.
ru: Шоколадное.

source: Chocolate it shall be.
ru: Пойдём, сынок.

source: It' s amazing, all this activity today.
ru: Поразительно; здесь сегодня все в хлопотах.

source: The guests and some staff left yesterday, but the...... last day' s always hectic.
ru: Гости и часть персонала выехали вчера, но последний...... день всегда суматошный.

source: Everybody wants to be on their way as early as possible.
ru: Каждый хочет отправиться в путь, как можно раньше.

source: By 5: 00 tonight, you' il never know anybody was ever here.
ru: Часов в 5 вы просто не поверите, что здесь кто- то когда- то был.

source: Just like a ghost ship, huh?
ru: Как корабль- призрак, да?

source: Do you know how I knew your name was Doc?
ru: Знаешь, как я узнал, что тебя зовут Док?

source: You know what I' m talking about, don' t you?
ru: Ты ведь понимаешь, о чём я говорю, верно?

source: I can remember when I was a little boy...... my grandmother and I could hold conversations...... entirely without ever opening our mouths.
ru: Я помню, когда я сам был маленьким мальчиком...... мы с моей бабушкой могли долго разговаривать...... совсем не открывая при этом наши рты.

source: She called it "shining."
ru: Она называла это "сиянием".

source: And for a long time I thought it was just the two of us...... that had "the shine" to us.
ru: И мне долго казалось, что только нас, двоих...... озаряет это "сияние".

source: Just like you probably thought you was the only one.
ru: И ты, наверно, тоже думал, что ты единственный.

source: But there are other folks...... though mostly they don' t know it, or don' t believe it.
ru: Но есть и другие люди...... хотя многие из них не знают об этом или не верят в это.

source: How long have you been able to do it?
ru: Давно ли ты стал способен делать это?

source: Why don' t you want to talk about it?
ru: Почему ты не хочешь говорить об этом?

source: I' m not supposed to.
ru: Я не должен.

source: Who says you ain' t supposed to?
ru: Кто говорит, что ты не должен?

source: Who' s Tony?
ru: Кто такой Тони?

source: Tony' s the little boy that lives in my mouth.
ru: Тони - это маленький мальчик, который живёт у меня во рту.

source: Is Tony the one that...... tells you things?
ru: Это Тони рассказывает тебе разные вещи?

source: How does he tell you things?
ru: Как он тебе рассказывает?

source: It' s like I go to sleep, and he shows me things.
ru: Я, как будто, засыпаю, а он показывает мне разное.

source: But when I wake up, I can' t remember everything.
ru: Но когда я просыпаюсь, я не всё могу вспомнить.

source: Does your mom and dad know about Tony?
ru: Твоя мама и папа знают про Тони?

source: Do they know he tells you things?
ru: Знают о его рассказах тебе?

source: Tony told me never to tell them.
ru: Тони велел мне не говорить им.

source: Has Tony ever told you anything about this place?
ru: Тони когда- нибудь говорил тебе что- нибудь об этом месте?

source: About the Overlook Hotel?
ru: Про отель "Овалук"?

source: Now think real hard, Doc.
ru: Теперь хорошенько подумай, Док.

source: Maybe he showed me something.
ru: Здесь есть что- то плохое?

source: Scared of nothing here.
ru: Знаешь, Док, когда что- то случается...... это может оставить за собой свой след.

source: Some shine...... and some don' t.
ru: Как, например...... если у кого- то подгорел тост.

source: Is there something bad here?
ru: Наверно, то, что случается, оставляет за собой разные следы.

source: You know, Doc, when something happens...... it can leave a trace of itself behind.
ru: Но не такие, которые может заметить каждый.

source: Not things that anyone can notice.
ru: Только люди, озаряемые сиянием, могут видеть эти следы.

source: Just like they can see things that haven' t happened yet...... sometimes they can see things that happened a long time ago.
ru: И они также могут видеть то, что ещё не произошло...... а иногда они видят то, что случилось давным- давно.

source: I think a lot of things happened right here...... in this particular hotel over the years.
ru: Я думаю, много всякого произошло вот здесь...... в этом самом отеле за долгие годы.

source: And not all of them was good.
ru: И не всё из этого было хорошим.

source: What about room 237?
ru: А комната 237?

source: Room 237?
ru: Комната 237?

source: You' re scared of room 237, ain' t you?
ru: Ты боишься комнаты 237, верно?

source: No, I ain' t.
ru: Нет, я не боюсь.

source: Mr. Hallorann, what is in room 237?
ru: Мистер Хэллоран, что там, в 237?

source: There ain' t nothing in room 237.
ru: Нет там ничего, в 237- ой.

source: But you ain' t got no business going in there anyway.
ru: Но тебе нечего там делать и незачем туда заходить.

source: So stay out.
ru: Так что, держись подальше.

source: Good morning, hon.
ru: Держись подальше!

source: I guess we' ve been staying up too late.
ru: Доброе утро, милый.

source: It' s really pretty outside.
ru: Твой завтрак готов.

source: I suppose I ought to try to do some writing first.
ru: Сколько сейчас времени?

source: No good ones.
ru: Примерно 11. 30.

source: Something will come.
ru: Господи!

source: It' s just a matter of settling into the habit of writing every day.
ru: Думаю, мы слишком поздно ложимся.

source: That' s all it is.
ru: Я знаю.

source: I love it.
ru: Я приготовила, как ты любишь: глазунью.

source: I really do.
ru: Славно.

source: I' ve never been this happy or comfortable anywhere.
ru: Там, за стенами, так хорошо.

source: It' s amazing how fast you get used to such a big place.
ru: Может, погуляешь со мной, когда позавтракаешь?

source: I tell you, when we first came up here...... l thought it was kind of scary.
ru: Наверно, я должен сперва попробовать что- нибудь написать.

source: I fell in love with it right away.
ru: Уже есть идеи?

source: When I came up here for my interview...... it was as though I' d been here before.
ru: Хороших нет.

source: I mean, we all have moments of deja vu...... but this was ridiculous.
ru: Что- нибудь придумается.

source: The loser has to keep America clean.
ru: Надо только выработать привычку писать каждый день.

source: - And you' re going to lose.
ru: - Ты проиграешь.

source: And I' m going to get you.
ru: А я догоню тебя.

source: You' d better run fast!
ru: Ты уж лучше беги быстрее!

source: I' m coming in close.
ru: Я уже совсем близко.

source: Loser has to keep America clean.
ru: Проигравший моет всю Америку.

source: IKeep America clean.
ru: Отмывай всю Америку.

source: Danny, you win.
ru: Ты выиграл, Дэнни.

source: Dead end.
ru: Дай мне руку.

source: Isn' t it beautiful?
ru: Красиво здесь, да?

source: It' s so pretty.
ru: Тупик.

source: I didn' t think it was going to be this big.
ru: Мы выбрались.

source: And the search continues for that missing Aspen woman.
ru: Красиво здесь, да?

source: She disappeared on a hunting trip with her husband.
ru: Просто прелесть.

source: They may have to call off the search...... if a predicted snowstorm moves in tomorrow.
ru: Я не думала, что он такой большой.

source: It' s incredible.
ru: А ты?

source: Hi, hon.
ru: ВТОРНИК

source: How' s it going?
ru: Как идут дела?

source: Get a lot written today?
ru: Много написал сегодня?

source: The weather forecast said it' s going to snow tonight.
ru: В прогнозе погоды сообщили, что сегодня пойдёт снег.

source: What do you want me to do about it?
ru: Перестань, милый.

source: Don' t be so grouchy.
ru: Не будь таким ворчливым.

source: I' m not...... being grouchy.
ru: Я не...... ворчливый.

source: I just want to finish my work.
ru: Я просто хочу закончить работу.

source: I' il come back later with a couple of sandwiches.
ru: Я зайду попозже и принесу пару сэндвичей.

source: Maybe you' il let me read something then.
ru: Может, тогда ты позволишь мне что- нибудь прочитать.

source: Wendy...... let me explain something to you.
ru: Венди...... позволь мне объяснить тебе.

source: When you come in and interrupt, you' re breaking my concentration.
ru: Когда ты приходишь и прерываешь меня, я теряю сосредоточенность.

source: You' re distracting me...... and it will then take me time to get back to where I was.
ru: Ты отвлекаешь меня...... и потом я теряю время, пытаясь собраться с мыслями.

source: We' re going to make a new rule:
ru: Мы устанавливаем новое правило:

source: Whenever I' m in here...... and you hear me typing...... or whatever the fuck you hear me doing in here...... when I' m in here, that means I am working.
ru: Когда я нахожусь здесь...... и ты слышишь, что я печатаю...... или неважно, что ты там слышишь, но знаешь, что я здесь...... когда я здесь, это значит, что я работаю.

source: That means don' t come in.
ru: Это значит не входить.

source: Now, do you think you can handle that?
ru: Как думаешь, ты это сможешь?

source: Why don' t you start right now and get the fuck out of here?
ru: Может, ты начнёшь прямо сейчас и уберёшься отсюда к чёрту?

source: All right, you!
ru: Промах!

source: Don' t have!
ru: Не надо!

source: No fair anymore.
ru: Так уже нечестно.

source: I knew it.
ru: СУББОТА

source: This is IKDlK 1 2 calling IKDlK 1.
ru: Так я и знала.

source: KDK 12 to KDK 1.
ru: КДК 12 вызывает КДК 1.

source: This is IKDlK 1.
ru: Это КДК 1.

source: We' re receiving you.
ru: Мы слышим вас.

source: Over.
ru: Приём.

source: Hi, this is Wendy Torrance at the Overlook Hotel.
ru: Это Венди Торрэнс из отеля "Овалук".

source: Hi, how are you folks getting on up there?
ru: Как вы там, друзья, держитесь?

source: We' re just fine.
ru: У нас всё отлично.

source: But our telephones aren' t doing too well.
ru: Но наши телефоны почему- то не работают.

source: Are the lines down, by any chance?
ru: Может, произошли поломки на линиях?

source: Yes, quite a few of them are down due to the storm.
ru: Да, несколько линий повреждено снегопадом.

source: Any chance of them being repaired soon?
ru: Есть вероятность, что их скоро починят?

source: Well, I wouldn' t like to say.
ru: Не могу ничего обещать.

source: Most winters they stay that way until spring.
ru: Было много зим, когда их оставляли так до весны.

source: Boy, this storm is really something, isn' t it?
ru: Эта снежная буря действительно разыгралась, да?

source: It' s one of the worst we' ve had for years.
ru: Одна из самых сильных, что были у нас здесь за многие годы.

source: Is there anything else we can do for you, Mrs. Torrance?
ru: Мы можем сделать для вас что- нибудь, миссис Торрэнс?

source: If you folks have any problems up there, just give us a call.
ru: Если у вас там возникнут проблемы, звоните нам.

source: And, Mrs. Torrance?
ru: И, миссис Торрэнс?

source: It might be a good idea if you leave your radio on all the time.
ru: Вам лучше было бы вообще не отключать вашу радиосвязь.

source: We' il do that.
ru: Мы так и сделаем.

source: It was real nice talking to you.
ru: Было приятно поговорить с вами.

source: Over and out.
ru: Приём, и отключаюсь.

source: Hello, Danny.
ru: Привет, Дэнни.

source: Come and play with us.
ru: Приходи поиграть с нами.

source: Come and play with us, Danny.
ru: Приходи поиграть с нами, Дэнни.

source: Forever...... and ever...... and ever.
ru: Навсегда...... и на веки вечные...... и на веки вечные.

source: Remember what Mr. Hallorann said.
ru: Тони...... мне страшно.

source: Please let me give you some money.
ru: Помнишь, что сказал Хэллоран.

source: Well, I' m going to have some coffee.
ru: Они не настоящие ".

source: Coffee will be ready in a few minutes.
ru: Можно мне пойти в свою комнату и взять мою пожарную машину?

source: Daddy' s asleep.
ru: Сначала подойди сюда на минутку.

source: I won' t make any noise.
ru: Как дела, Док?

source: He only went to bed a few hours ago.
ru: Тебе хорошо здесь?

source: I won' t make a sound.
ru: Да, папа.

source: Okay, Mom.
ru: Я хочу, чтобы тебе было хорошо.

source: Can I go to my room and get my fire engine?
ru: Мне хорошо, папа.

source: How' s it going, Doc?
ru: Ты плохо себя чувствуешь?

source: I' m just a little bit tired.
ru: Я просто немножко устал.

source: Then why don' t you go to sleep?
ru: Почему ты не ляжешь поспать?

source: I got too much to do.
ru: У меня слишком много дел.

source: Do you like this hotel?
ru: Тебе нравится этот отель?

source: I want you to like it here.
ru: Хочу, чтобы тебе здесь нравилось.

source: I wish we could stay here forever...... and ever...... and ever.
ru: Мне бы хотелось, чтобы мы остались здесь навсегда...... на веки вечные...... на веки вечные.

source: You would never hurt Mommy or me, would you?
ru: Ты никогда не обидишь маму или меня, нет?

source: Did your mother ever say that to you?
ru: Твоя мать когда- нибудь говорила тебе такое?

source: That I would hurt you?
ru: Что я могу обидеть тебя?

source: No, Dad.
ru: Нет, папа.

source: Yes, Dad.
ru: Да, папа.

source: I love you, Danny.
ru: Я люблю тебя, Дэнни.

source: I love you more than anything else...... in the whole world...... and I would never do anything to hurt you...... never.
ru: Я никогда не сделаю тебе ничего плохого...... никогда.

source: You know that, don' t you?
ru: Ты это знаешь, ведь верно?

source: Mom, are you in there?
ru: Мама, ты там?

source: Honey...... what' s wrong?
ru: Милый...... что с тобой?

source: I had the most...... terrible nightmare I ever had.
ru: У меня был самый...... ужасный кошмар в жизни.

source: - It was the most horrible dream.
ru: - Это был чудовищный сон.

source: - It' s okay, it' s okay now.
ru: - Всё уже хорошо.

source: I dreamed that I...... that I killed you and Danny.
ru: Мне приснилось, что я...... что я убил тебя и Дэнни.

source: But I didn' t just kill you.
ru: Но я не просто убил вас.

source: I cut you up into little pieces.
ru: Я разрубил вас на мелкие куски.

source: I must be losing my mind.
ru: Должно быть, я схожу с ума.

source: Everything' s going to be all right.
ru: Всё будет хорошо.

source: Let' s get up off the floor.
ru: Давай поднимемся с пола.

source: Danny!
ru: Дэнни!

source: Everything' s okay!
ru: Всё хорошо!

source: Just go play in your room for a while.
ru: Ступай в свою комнату и поиграй немножко.

source: Your dad' s just got a headache.
ru: У твоего папы просто голова разболелась.

source: Danny, mind what I say.
ru: Дэнни, делай, что я говорю.

source: Go play in your room.
ru: Иди в свою комнату и поиграй.

source: Honey, let me just go get him out of here.
ru: Милый, дай мне только выставить его отсюда.

source: Why don' t you mind me?
ru: Почему ты не слушаешься меня?

source: What happened to your neck?
ru: Что с твоей шеей?

source: You did this to him...... didn' t you?!
ru: Это ты сделал с ним...... это же ты?!

source: You did this to him!
ru: Ты сделал это с ним!

source: Didn' t you?!
ru: Ведь это же ты?!

source: How could you?!
ru: Как ты мог?!

source: I' d give anything for a drink.
ru: Я бы всё отдал, чтобы выпить.

source: I' d give my goddamn soul...... for just a glass of beer.
ru: Я бы отдал свою проклятую душу...... за простой стакан пива.

source: Hi, Lloyd.
ru: Привет, Ллойд.

source: A little slow tonight, isn' t it?
ru: Сегодня здесь немного людно, не так ли?

source: Yes it is, Mr. Torrance.
ru: Да, это так, мистер Торрэнс.

source: What will it be?
ru: Что будете?

source: I' m awfully glad you asked me that, Lloyd...... because I just happen to have two twenties...... and two tens right here in my wallet.
ru: Я страшно рад, что ты спросил меня об этом, Ллойд...... потому что у меня как раз есть две двадцатки...... и две десятки, вот они, здесь, в бумажнике.

source: I was afraid they were going to be there until next April.
ru: Я опасался, что они пролежат тут до следующего апреля.

source: So here' s what:
ru: Значит, так:

source: You slip me a bottle of bourbon...... a little glass and some ice.
ru: Ты даёшь мне бутылку "бурбона"...... стаканчик и немного льда.

source: You can do that, can' t you, Lloyd?
ru: Ты это можешь, не так ли?

source: You' re not too busy, are you?
ru: Ты же не слишком занят, верно?

source: I' m not busy at all.
ru: Я совсем не занят.

source: Good man.
ru: Молодец.

source: You set them up...... and I' il knock them back, one by one.
ru: Ты мне их готовь...... а я буду их опрокидывать, стопку за стопку.

source: White man' s burden, Lloyd, my man.
ru: Бремя белого человека, Ллойд, друг мой.

source: White man' s burden.
ru: Бремя белого человека.

source: Say, Lloyd...... it seems I' m temporarily light.
ru: Знаешь, Ллойд...... оказывается, я сегодня пустой.

source: How' s my credit in this joint, anyway?
ru: Кстати, есть ли у меня кредит в этом заведении?

source: Your credit' s fine, Mr. Torrance.
ru: Полный кредит, мистер Торрэнс.

source: I like you, Lloyd.
ru: Это здорово.

source: You were always the best of them.
ru: Ты мне нравишься, Ллойд.

source: Best goddamned bartender...... from Timbuktu to Portland, Maine.
ru: Ты всегда мне нравился.

source: Or Portland, Oregon, for that matter.
ru: Ты всегда был лучшим из них.

source: I hope it' s nothing serious.
ru: Самый лучший чёртов бармен...... от Тимбукту до Портленда, штат Мэн.

source: Just a little problem with...... the old sperm bank upstairs.
ru: Или до Портленда, штат Орегон, если уж на то пошло.

source: Can' t live with them...... can' t live without them.
ru: Проклятье, я никогда даже пальцем его не трогал.

source: Words of wisdom, Lloyd.
ru: Не трогал.

source: I didn' t.
ru: Чёрт, я бы не прикоснулся даже к волоску на его головке.

source: I wouldn' t touch one hair on his goddamn little head.
ru: Я люблю этого малыша.

source: I love the little son of a bitch.
ru: Я готов сделать для него всё.

source: Any fucking thing for him.
ru: Любую чёртову фигню для него.

source: But that bitch!
ru: Но эта сука!

source: As long as I live...... she' il never let me forget what happened.
ru: Пока я жив...... она никогда не даст мне забыть о том, что произошло.

source: I did hurt him once, okay?
ru: Однажды я сделал ему больно, так?

source: It was an accident.
ru: Это была случайность.

source: Completely unintentional.
ru: Совершенно неумышленная.

source: It could have happened to anybody.
ru: Такое могло бы случиться с каждым.

source: And it was three goddamn years ago!
ru: И с тех пор прошло три проклятых года!

source: The little fucker had thrown all my papers all over the floor.
ru: Маленький мерзавец разбросал по полу все мои бумаги.

source: All I tried to do was pull him up.
ru: Я только хотел остановить его.

source: A momentary loss of muscular coordination.
ru: На миг потерял контроль над своей мускулатурой.

source: Thank God you' re here.
ru: Я хочу сказать...... несколько лишних фунтов веса, вложенных в силу пинка...... в секунду, в секунду!

source: There' s someone else in the hotel with us.
ru: Слава Богу, ты здесь.

source: There' s a crazy woman in one of the rooms.
ru: В отеле, кроме нас, есть ещё кто- то.

source: She tried to strangle Danny.
ru: Она пыталась задушить Дэнни.

source: Are you out of your fucking mind?
ru: Ты с ума сошла, мать твою?

source: It' s the truth!
ru: Это правда.

source: I swear it.
ru: Я клянусь!

source: Danny told me.
ru: Дэнни рассказал мне.

source: He went up into one of the bedrooms.
ru: Он зашёл в одну из спален.
